//std：系统默认的命名空间，包含所有的外部名称
/*
::用来引用命名空间定义的对象
C89：一个有32个关键字
*/

/*C++命名规则：只能大小写字母+数字+下划线
开头只能用—下划线或者字母
无长度限制
*/

/*C++开发步骤
编辑（C++源文件生成.cpp）--编译（目标代码.obj）
--连接（.obj和.lib[库文件]生成执行文件[.exe]）--执行


操作系统命名不同：
MS-DOS命名字符数最多为8
windows允许长文件名


1. 在每个C++程序中都必须包含有这样一个函数，该函数的函数名
为（A）
A. main B. MAIN C. name D. function


2. 以下叙述不正确的是（A）。
A. C++程序书写格式规定，一行内只能写一个语句
B. main()函数后面有一对花括号，花括号内的部分称为函数体
C. 一个C++程序必须有main()函数
D. C++规定函数内的每个语句以分号结束

3. 以下叙述正确的是(D)。
A. 在C++程序中，main函数必须位于程序的最前面
B. C++程序的每行中只能写一条语句
C. 在对一个C++程序进行编译的过程中，可发现注释中的拼写错误
D. C++语言本身没有输入、输出语句

4. C++语言属于（D）
A. 机器语言 B. 低级语言 C. 中级语言 D. 高级语言

5. 下列说法正确的是（D）。
A. 用C++语言书写程序时，不区分大小写字母
B. 用C++语言书写程序时，一个语句可以分几行写
C. 用C++语言书写程序时，一行只能写一个语句
D. 用C++语言书写程序时，每行必需有行号

6. C++语言中的函数，下列书写正确的是（D）
A. int a() 
B. double f(){ 
C. float fun{} 
D. void h(){}


7. 编写、调试运行C++程序的顺序是（A）
A．编辑、编译、连接、运行
B．编译、编辑、连接、运行
C．编辑、连接、编译、运行
D．编辑、编译、运行、连接
*/
